modules/jemacs-unarrange.el
;;; mycraft --- Summary  -*- lexical-binding: t; -*-
;;; Copyright (C) 2020 mycraft maintainers
;;; Author: Jing
;;; package --- mycraft
;;; Commentary:

;;; Code:

(use-package winner
  :commands (winner-undo))

(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode)
  :config
  (setq all-the-icons-dired-monochrome nil)
  (set-face-attribute 'all-the-icons-dired-dir-face nil :foreground "#FF8822"))

(use-package esup
  :defer t
  :init
  (setq esup-depth 0))

(use-package svg-lib
  :defer 1
  :straight (svg-lib :type git :host github :files ("*.el") :repo "rougier/svg-lib"))

(use-package diminish :defer t)

(use-package command-log-mode
  :commands command-log-mode)

(use-package rainbow-mode
  :defer t)

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package highlight-parentheses
  :hook (prog-mode . highlight-parentheses-mode))

(use-package polymode
  :defer t)

(use-package poly-ansible
  :defer t)

(use-package devdocs
  :defer t
  :straight (
             :local-repo "~/Desktop/spacemacs-private/local/devdocs"))

(use-package counsel-jq-yq
  :defer 1
  :straight (
             :local-repo "~/Desktop/spacemacs-private/local/counsel-jq-yq"
             )
  ;; :load-path "~/Desktop/spacemacs-private/local/counsel-jq-yq"
  ;; :config
  ;; (package-generate-autoloads "counsel-jq-yq" "~/Desktop/spacemacs-private/local/counsel-jq-yq")
  ;; (load-library "counsel-jq-yq-autoloads"))
  )

(use-package gotests
  :defer 1
  :straight (
             :local-repo "~/Desktop/spacemacs-private/local/gotests"
             )
  ;; the file with suffix -test will be treated as tests files by default
  ;; which will function as package files.
  ;; :load-path "~/Desktop/spacemacs-private/local/go-test"
  ;; :config
  ;; (package-generate-autoloads "go-test" "~/Desktop/spacemacs-private/local/go-test")
  ;; (load-library "go-test-autoloads")
  )

(use-package hl-todo
  :defer t
  :hook
  ;; (text-mode . hl-todo-mode) text-mode is the parent of org-mode
  (prog-mode . hl-todo-mode)
  :config
  (setq hl-todo-highlight-punctuation ":")
  (setq hl-todo-keyword-faces
        `(
          ("TODO" warning bold)
          ("FIXME" error bold)
          ("HACK" font-lock-constant-face bold)
          ("NOTE" success bold)
          ("BUG" error bold)
          ("DEPRECATED" font-lock-doc-face bold))))

(use-package diff-hl
  :defer 1
  :init
  (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
  :config
  (global-diff-hl-mode))

(use-package so-long
  :defer 1
  :config
  (global-so-long-mode 1))

(use-package rime
  :defer 1
  :straight (rime :type git
                  :host github
                  :repo "DogLooksGood/emacs-rime"
                  :files ("*.el" "Makefile" "lib.c"))
  :custom
  (rime-librime-root (expand-file-name "librime/dist" user-emacs-directory))
  (rime-emacs-module-header-root "/usr/local/opt/emacs-plus@29/include/")
  (rime-user-data-dir "/Users/jing/Library/Rime/")
  (rime-inline-ascii-trigger 'shift-l)
  (default-input-method "rime")
  (rime-show-candidate 'posframe)

  :config
  (setq rime-translate-keybindings
        '("C-f" "C-b" "C-n" "C-p" "C-g" "<left>" "<return>" "TAB" "<tab>" "<right>" "<up>" "<down>" "<prior>" "<next>" "<delete>"))
  (define-key rime-mode-map (kbd "C-'") 'rime-inline-ascii))

(use-package perspective
  :diminish persp-mode
  :commands (persp-switch)
  :custom
  (persp-modestring-short t)
  :config
  (persp-mode))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.05)
  (which-key-mode 1))

(use-package define-word
  :defer t)

(use-package powerthesaurus
  :defer t)

(use-package alert
  :commands alert
  :config
  (if (system-is-mac!)
      (setq alert-default-style 'osx-notifier)))

(use-package nov
  :defer t
  :mode ("\\.epub\\'" . nov-mode))

(use-package uuidgen
  :defer t)

(use-package docker
  :defer t)

(use-package docker-tramp
  :defer t)

(use-package dockerfile-mode
  :defer t)

(use-package nginx-mode
  :defer t)

(use-package jsonnet-mode
  :defer t)

(use-package conf-mode
  :defer t
  :mode ("poetry\\.lock" . conf-toml-mode))

(use-package jinja2-mode
  :defer t
  :init
  (add-hook 'jinja2-mode-hook
            #'(lambda ()
                (set (make-local-variable 'indent-line-function) 'insert-tab)))
  :mode ("\\.j2\\'" . jinja2-mode))

(use-package make-mode
  :defer t
  :init
  (add-hook 'makefile-mode-hook
            #'(lambda ()
                (setq-local indent-tabs-mode t))))

(use-package racket-mode
  :defer t)

(use-package smartparens
  :defer 0
  :commands (smartparens-mode)
  :hook
  (js-mode . smartparens-mode)
  (go-mode . smartparens-mode)
  (html-mode . smartparens-mode)
  (python-mode . smartparens-mode)
  (emacs-lisp-mode . smartparens-mode)
  :config
  (require 'smartparens-config))
