modules/jemacs-unarrange_lp.org
* yasnippet

  TODO: find a way to replace the hardcode path
  =(yas-reload-all)= will rebuild the snippets, This will be trigger when enable yas-xx-mode

  #+begin_src emacs-lisp
    (use-package yasnippet
      :defer 1
      :config
      (add-to-list 'yas-snippet-dirs "/Users/jing/Desktop/spacemacs-private/snippets")
      ;; (yas-global-mode 1)
      (yas-minor-mode 1))

    (use-package yasnippet-snippets
      :defer t
      :after yasnippet)

    (use-package ivy-yasnippet
      :defer t
      :after yaanippet)

  #+end_src

* helpful
  make help description more readble
  #+begin_src emacs-lisp
    (use-package helpful
      :custom
      (counsel-describe-function-function #'helpful-callable)
      (counsel-describe-variable-function #'helpful-variable)
      :bind
      ([remap describe-function] . counsel-describe-function)
      ([remap describe-command] . helpful-command)
      ([remap describe-variable] . counsel-describe-variable)
      ([remap describe-key] . helpful-key))
  #+end_src

* expand-region
  a convenient selection expander.

  #+begin_src emacs-lisp
    (use-package expand-region
      :commands
      (er--expand-region-1)
      :defer t)
  #+end_src

* winum
  #+begin_src emacs-lisp
    (use-package winum
      :defer 0
      :config
      (winum-mode))
  #+end_src

* systemd

  encounter an *issue: Company backend ’t’ could not be initialized*
  #+begin_src emacs-lisp
    (use-package systemd
      :defer t)
  #+end_src

* frontend development
  #+begin_src emacs-lisp
    (use-package emmet-mode
      :defer t
      :hook
      (html-mode . emmet-mode)
      (web-mode . emmet-mode))

    (use-package web-mode
      :defer t
      :mode
      (("\\.html\\'" . web-mode)))

    (use-package js2-mode
      :after (rainbow-delimiters)
      :defer t
      :config
      (setq js2-mode-show-parse-errors nil)
      (setq js2-mode-show-strict-warnings nil)
      (js2-minor-mode))
  #+end_src

* flycheck mode
  #+begin_src emacs-lisp
    (use-package flycheck
      :commands (flycheck-mode)
      :init
      (add-hook 'prog-mode-hook 'flycheck-mode)
      (add-hook 'text-mode-hook 'flycheck-mode)
      (setq flycheck-highlighting-mode 'lines)
      (setq flycheck-indication-mode '())
      :config
      (add-hook 'org-src-mode-hook #'(lambda ()
                                      (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))))
  #+end_src

* json-mode & yaml-mode

  use =make-local-variable= to set buffer local variable.

  #+begin_src emacs-lisp
    (use-package json-mode
      :defer t)

    (use-package yaml-mode
      :defer t
      :mode (("\\.\\(yml\\|yaml\\)\\'" . yaml-mode)
             ("Procfile\\'" . yaml-mode))
      :init
      (add-hook 'yaml-mode-hook 'lsp)
      (add-hook 'yaml-mode-hook #'(lambda ()
                                    (set (make-local-variable 'tab-width) 2)
                                    (set (make-local-variable 'evil-shift-width) 2)
                                    (set (make-local-variable 'indent-line-function) 'my-yaml-indent-line)))
      :config
      ;; (with-eval-after-load 'evil
      ;;   (evil-define-key 'normal yaml-mode-map (kbd "=") 'yaml-indent-line))
      (with-eval-after-load 'flycheck
        (when (listp flycheck-global-modes)
          (add-to-list 'flycheck-global-modes 'yaml-mode))))
  #+end_src

  a quick way to find the path for value

  #+begin_src emacs-lisp
    (use-package json-snatcher
      :defer t)
  #+end_src

* cmake
  #+begin_src emacs-lisp
    (use-package cmake-mode
      :defer t
      :mode (("CMakeLists\\.txt\\'" . cmake-mode) ("\\.cmake\\'" . cmake-mode)))
  #+end_src

* lua
  #+begin_src emacs-lisp
    (use-package lua-mode
      :mode ("\\.lua\\'" . lua-mode)
      :defer t)
  #+end_src

* common lisp or emacs lisp

  TODO: maybe I neeed the better go to definition function like the spacemacs's implementation

  #+begin_src emacs-lisp
    (use-package slime
      :defer t
      :init
      (setq inferior-lisp-program "sbcl"))

    (use-package elisp-slime-nav
      :defer t
      :init
      (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
        (add-hook hook 'elisp-slime-nav-mode)))

    (use-package lispy
      :init
      (setq lispy-key-theme '(special c-digits))
      :hook ((common-lisp-mode . lispy-mode)
             (emacs-lisp-mode . lispy-mode)
             (scheme-mode . lispy-mode))
      :config
      (with-eval-after-load 'evil-matchit
        (lispy-define-key lispy-mode-map (kbd "%") 'lispy-different)
        (lispy-define-key lispy-mode-map (kbd "d") 'lispy-kill)))

  #+end_src

* rust mode
  #+begin_src emacs-lisp
    (use-package rust-mode
      :defer t
      :mode "\\.rs\\'"
      :init (setq rust-format-on-save t))

    (use-package cargo
      :defer t)

  #+end_src

* go mode
  #+begin_src emacs-lisp
    (use-package go-mode
      :defer 2
      :config
      (progn
        (setq gofmt-command "goimports")
        (add-hook 'before-save-hook 'gofmt-before-save)))

    (use-package protobuf-mode
      :defer t)

    (use-package gomacro-mode
      :hook (go-mode . gomacro-mode))
  #+end_src

* python mode

  This is a basic setup for python language.

  #+begin_src emacs-lisp
    (with-eval-after-load 'python
      (setq python-shell-interpreter "ipython"))

    (use-package python-pytest
      :defer t
      :custom
      (python-pytest-confirm t))

    (use-package poetry
      :defer t)

    (use-package pyvenv
      :commands (pyvenv-mode)
      :init
      (add-hook 'python-mode-hook #'pyvenv-mode))

    (use-package pyimport
      :defer t
      :init
      (add-hook 'before-save-hook 'pyimport-remove-unused))

    (use-package cython-mode
      :defer t)
  #+end_src

* dumb-jump

  a jump to definition with search tool (ag, rg)

  #+begin_src emacs-lisp
    (use-package dumb-jump
      :init
      (setq dumb-jump-selector 'ivy)
      :defer t)
  #+end_src

* lsp mode

  run =company-diag= to check what the company-backen is being used.
  =(setq lsp-keymap-prefix "SPC m")= this will only affect the display info of whichkey.


  If you want a breadcrumb to hint current position, add the following setting.
  #+begin_src emacs-lisp :tangle no
    (lsp-mode . (lambda () (lsp-headerline-breadcrumb-mode)))
  #+end_src

  #+begin_src emacs-lisp
    (use-package lsp-mode
      :init
      (setq lsp-completion-provider :capf) ;; the official recommends use this
      (setq lsp-enable-symbol-highlighting nil)
      (setq lsp-signature-render-documentation nil)
      (setq read-process-output-max (* 1024 1024))
      ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
      :commands
      (lsp)
      :hook
      (go-mode . lsp)
      (python-mode . lsp)
      (lua-mode . lsp)
      (rust-mode . lsp)
      (js-mode . lsp)
      (c-mode . lsp)
      (c++-mode . lsp)
      :config
      ;; turn off lens mode
      (setq lsp-lens-enable nil)
      (setq lsp-headerline-breadcrumb-enable nil)
      (setq lsp-enable-folding nil)
      (setq lsp-enable-snippet nil)
      (setq lsp-enable-imenu nil)
      (setq lsp-enable-links nil))

    (use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

    (use-package dap-mode
      :defer t
      :config
      ;; pip install "ptvsd>=4.2"
      (require 'dap-python)
      (require 'dap-go)
      ;; dap-go-setup
      (add-hook 'dap-stopped-hook
                (lambda (arg) (call-interactively #'dap-hydra))))
  #+end_src

  #+begin_src emacs-lisp :tangle no
    (use-package lsp-python-ms
      :after
      (lsp-mode)
      :init
      (setq lsp-python-ms-auto-install-server t))
  #+end_src

  in the beginning, you may need to install the pyright server manually
  commands: lsp install server: pyright

  Notes: the dependencies node version
  https://github.com/emacs-lsp/lsp-pyright/issues/34

  #+begin_src emacs-lisp
    (use-package lsp-pyright
      :defer t
      :custom ((lsp-pyright-multi-root nil))
      :hook (python-mode . (lambda ()
                             (require 'lsp-pyright)
                             (lsp))))

  #+end_src

  currently, disable =lsp-ui=

  #+begin_src emacs-lisp :tangle no
    (use-package lsp-ui
      :after flycheck
      :commands lsp-ui-mode
      :config
      (setq lsp-ui-doc-enable nil)
      (setq lsp-ui-sideline-enable nil))
  #+end_src

