modules/jemacs-unarrange.el

(use-package yasnippet
  :defer 1
  :config
  (add-to-list 'yas-snippet-dirs "/Users/jing/Desktop/spacemacs-private/snippets")
  ;; (yas-global-mode 1)
  (yas-minor-mode 1))

(use-package yasnippet-snippets
  :defer t
  :after yasnippet)

(use-package ivy-yasnippet
  :defer t
  :after yaanippet)

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(use-package expand-region
  :commands
  (er--expand-region-1)
  :defer t)

(use-package winum
  :defer 0
  :config
  (winum-mode))

(use-package systemd
  :defer t)

(use-package emmet-mode
  :defer t
  :hook
  (html-mode . emmet-mode)
  (web-mode . emmet-mode))

(use-package web-mode
  :defer t
  :mode
  (("\\.html\\'" . web-mode)))

(use-package js2-mode
  :after (rainbow-delimiters)
  :defer t
  :config
  (setq js2-mode-show-parse-errors nil)
  (setq js2-mode-show-strict-warnings nil)
  (js2-minor-mode))

(use-package flycheck
  :commands (flycheck-mode)
  :init
  (add-hook 'prog-mode-hook 'flycheck-mode)
  (add-hook 'text-mode-hook 'flycheck-mode)
  (setq flycheck-highlighting-mode 'lines)
  (setq flycheck-indication-mode '())
  :config
  (add-hook 'org-src-mode-hook #'(lambda ()
                                  (setq-local flycheck-disabled-checkers '(emacs-lisp-checkdoc)))))

(use-package json-mode
  :defer t)

(use-package yaml-mode
  :defer t
  :mode (("\\.\\(yml\\|yaml\\)\\'" . yaml-mode)
         ("Procfile\\'" . yaml-mode))
  :init
  (add-hook 'yaml-mode-hook 'lsp)
  (add-hook 'yaml-mode-hook #'(lambda ()
                                (set (make-local-variable 'tab-width) 2)
                                (set (make-local-variable 'evil-shift-width) 2)
                                (set (make-local-variable 'indent-line-function) 'my-yaml-indent-line)))
  :config
  ;; (with-eval-after-load 'evil
  ;;   (evil-define-key 'normal yaml-mode-map (kbd "=") 'yaml-indent-line))
  (with-eval-after-load 'flycheck
    (when (listp flycheck-global-modes)
      (add-to-list 'flycheck-global-modes 'yaml-mode))))

(use-package json-snatcher
  :defer t)

(use-package cmake-mode
  :defer t
  :mode (("CMakeLists\\.txt\\'" . cmake-mode) ("\\.cmake\\'" . cmake-mode)))

(use-package lua-mode
  :mode ("\\.lua\\'" . lua-mode)
  :defer t)

(use-package slime
  :defer t
  :init
  (setq inferior-lisp-program "sbcl"))

(use-package elisp-slime-nav
  :defer t
  :init
  (dolist (hook '(emacs-lisp-mode-hook ielm-mode-hook))
    (add-hook hook 'elisp-slime-nav-mode)))

(use-package lispy
  :init
  (setq lispy-key-theme '(special c-digits))
  :hook ((common-lisp-mode . lispy-mode)
         (emacs-lisp-mode . lispy-mode)
         (scheme-mode . lispy-mode))
  :config
  (with-eval-after-load 'evil-matchit
    (lispy-define-key lispy-mode-map (kbd "%") 'lispy-different)
    (lispy-define-key lispy-mode-map (kbd "d") 'lispy-kill)))

(use-package rust-mode
  :defer t
  :mode "\\.rs\\'"
  :init (setq rust-format-on-save t))

(use-package cargo
  :defer t)

(use-package go-mode
  :defer 2
  :config
  (progn
    (setq gofmt-command "goimports")
    (add-hook 'before-save-hook 'gofmt-before-save)))

(use-package protobuf-mode
  :defer t)

(use-package gomacro-mode
  :hook (go-mode . gomacro-mode))

(use-package dumb-jump
  :init
  (setq dumb-jump-selector 'ivy)
  :defer t)

(use-package lsp-mode
  :init
  (setq lsp-completion-provider :capf) ;; the official recommends use this
  (setq lsp-enable-symbol-highlighting nil)
  (setq lsp-signature-render-documentation nil)
  (setq read-process-output-max (* 1024 1024))
  ;; https://emacs-lsp.github.io/lsp-mode/page/performance/
  :commands
  (lsp)
  :hook
  (go-mode . lsp)
  (python-mode . lsp)
  (lua-mode . lsp)
  (rust-mode . lsp)
  (js-mode . lsp)
  (c-mode . lsp)
  (c++-mode . lsp)
  :custom
  (lsp-lens-enable nil) ;; turn off lens mode
  (lsp-headerline-breadcrumb-enable nil)
  (lsp-enable-folding nil)
  (lsp-enable-snippet nil)
  (lsp-enable-imenu nil)
  (lsp-enable-links nil))

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)

(use-package dap-mode
  :defer t
  :config
  ;; pip install "ptvsd>=4.2"
  (require 'dap-python)
  (require 'dap-go)
  ;; dap-go-setup
  (add-hook 'dap-stopped-hook
            (lambda (arg) (call-interactively #'dap-hydra))))

(use-package ivy
  :ensure t
  :diminish
