modules/jemacs-unarrange_lp.org
* ivy & swiper & counsel

  =(setq ivy-use-selectable-prompt t)=
  to make the candidate you typed selectable. This is useful when you call =counsel-find-file=.
  Ex. You can choose the bar.yml when there is a candidate named barfar.yml

  =(setq ivy-initial-inputs-alist nil)=
  let the input in the ivy-minibuffer empty when opening the it.


  #+begin_src emacs-lisp
    (use-package ivy
      :ensure t
      :diminish
      :bind (:map ivy-minibuffer-map
                  ("TAB" . ivy-alt-done)
                  ("C-l" . ivy-alt-done)
                  ("C-j" . ivy-next-line)
                  ("C-k" . ivy-previous-line)
                  ("C-u" . ivy-backward-kill-word)
                  :map ivy-switch-buffer-map
                  ("C-k" . ivy-previous-line)
                  ("C-l" . ivy-done)
                  ("C-d" . ivy-switch-buffer-kill)
                  :map ivy-reverse-i-search-map
                  ("C-k" . ivy-previous-line)
                  ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1)
      (setq ivy-more-chars-alist '((t . 2))) ;; set the char limit when searching with ivy
      (setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
      (setq ivy-use-selectable-prompt t)
      ;; (setq ivy-dynamic-exhibit-delay-ms 250)
      (setq ivy-initial-inputs-alist nil)
      (with-eval-after-load 'evil
        (define-key ivy-occur-grep-mode-map (kbd "w") nil)
        (evil-define-key 'normal ivy-occur-grep-mode-map
          (kbd "i")
          #'(lambda ()
              (interactive)
              (ivy-wgrep-change-to-wgrep-mode)
              (evil-insert-state)))))

    (use-package ivy-rich
      :after (ivy)
      :init
      (ivy-rich-mode 1))
  #+end_src

  After calling =swiper=, =counsel search=, ivy-occur (C-c C-o) will get all the candidates in another buffer.
  Then we can enter edit mode by ivy-wgrep-change-to-wgrep-mode (C-x C-q)

  Use =multiple-cursor= may be helpful here.
  Finally, =Ctrl-c Ctrl-c= to commit change
  there are some key binding in the swiper-map

  #+begin_src emacs-lisp
    (use-package swiper
      :bind (("C-s" . swiper)))
  #+end_src

  #+begin_src emacs-lisp
    (use-package counsel
      :bind (("M-x" . counsel-M-x)
             ("C-x b" . counsel-ibuffer)
             ("C-x C-f" . counsel-find-file)
             :map minibuffer-local-map
             ("C-w" . 'ivy-backward-kill-word)
             :map ivy-minibuffer-map
             ("C-w" . 'ivy-backward-kill-word)
             ("C-r" . 'counsel-minibuffer-history))
      :config
      (setq counsel-find-file-at-point t))

    ;; counsel-search will use the package request with this function
    (use-package request
      :defer t)

  #+end_src

* projectile
  #+begin_src emacs-lisp
    (use-package projectile
      :defer 1
      :custom ((projectile-completion-system 'ivy))
      :config
      (define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
      (add-to-list 'projectile-project-root-files-bottom-up "pyproject.toml")
      (projectile-mode +1))

    (use-package counsel-projectile
      :after projectile
      :defer 1
      :config (counsel-projectile-mode))
  #+end_src

* avy
  =(setq avy-background t)= will diminish the background to make the target clearly.

  #+begin_src emacs-lisp
    (use-package avy
      :defer t
      :config
      (setq avy-background t))

  #+end_src

* vterm

  Failed to install vterm: https://melpa.org/packages/vterm-20200926.1215.tar: Not found
  =package-refresh-contents=

  Optional, you can send additional string and perform it after vterm open

  the following is replaced by other function
  #+begin_src emacs-lisp :tangle no
    (add-hook 'vterm-mode-hook (lambda ()
                                 (vterm-send-string "source ~/.bash_profile")
                                 (vterm-send-return)
                                 (evil-emacs-state)))
  #+end_src

  if you want to customize the vterm's font, you could add the settings below
  #+begin_src emacs-lisp :tangle no
    (add-hook #'(lambda ()
                  (set-face-attribute 'variable-pitch nil :font "Sarasa Mono SC")
                  (set (make-local-variable 'buffer-face-mode-face) 'variable-pitch)
                  (buffer-face-mode t)))
  #+end_src

  #+begin_src emacs-lisp
    (use-package vterm
      :defer t
      :init
      (setq vterm-always-compile-module t)
      (setq vterm-timer-delay 0.01)
      (with-eval-after-load 'evil
        (evil-set-initial-state 'vterm-mode 'emacs))
      :config
      (define-key vterm-mode-map (kbd "<escape>") 'vterm-send-escape))
  #+end_src

  #+begin_src emacs-lisp
    (use-package vterm-toggle
      :defer t)
  #+end_src

* ediff

  #+begin_src emacs-lisp
    (use-package ediff
      :defer t
      :init
      (setq ediff-window-setup-function 'ediff-setup-windows-plain)
      (setq ediff-split-window-function 'split-window-horizontally))
  #+end_src

* evil
  it's evil! provide you vim-like ux in emacs.

  #+begin_src emacs-lisp
    (use-package evil
      :defer 0
      :init
      (setq evil-want-keybinding nil) ;; this will cause some evil keybinding
      ;; of other modes not working when it's set to true
      :config
      (setq evil-want-integration t)
      (setq evil-want-C-u-scroll t)
      (setq evil-want-C-i-jump nil)
      (evil-mode 1)
      (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
      ;; Use visual line motions even outside of visual-line-mode buffers
      (evil-define-key 'normal prog-mode-map (kbd "C-j") 'evil-scroll-line-down)
      (evil-define-key 'normal prog-mode-map (kbd "C-k") 'evil-scroll-line-up)
      (evil-define-key 'normal prog-mode-map (kbd "g h") 'flycheck-display-error-at-point)
      (evil-define-key 'normal prog-mode-map (kbd "U") 'undo-redo)


      (evil-global-set-key 'motion "j" 'evil-next-visual-line)
      (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

      (evil-set-initial-state 'messages-buffer-mode 'normal)
      (evil-set-initial-state 'dashboard-mode 'normal)

      (add-hook 'evil-normal-state-entry-hook 'im-use-eng)
      (add-hook 'evil-insert-state-entry-hook 'im-use-prev)
      (add-hook 'evil-insert-state-exit-hook 'im-remember)
      (add-hook 'evil-emacs-state-entry-hook 'im-use-eng))
  #+end_src

  evil-matchit  make =%= to be able to jump to and back the tag
  evil-collection provides some pre-defined evil key binding for other-modes.

  #+begin_src emacs-lisp
    (use-package evil-matchit
      :after evil
      :config
      (global-evil-matchit-mode 1))

    (use-package evil-collection
      :after evil
      :config
      (delete 'wgrep evil-collection-mode-list)
      (delete 'vterm evil-collection-mode-list)
      (delete 'lispy evil-collection-mode-list)
      (delete 'ivy evil-collection-mode-list)
      (delete 'view evil-collection-mode-list)
      ;; this will bind a global esc key for minibuffer-keyboard-quit so I remove it.
      (setq evil-collection-company-use-tng nil)
      (add-hook 'evil-collection-setup-hook #'(lambda (_mode mode-keymaps &rest _rest)
                                                (when (eq _mode 'docker)
                                                  (evil-define-key 'normal 'docker-container-mode-map (kbd "b") 'docker-container-vterm))))
      (evil-collection-init))
  #+end_src

  evil-nerd-commenter provide the quick comment util functions.

  #+begin_src emacs-lisp
    (use-package evil-nerd-commenter
      :after evil
      :commands evilnc-comment-operator
      :init
      (define-key evil-normal-state-map "gc" 'evilnc-comment-operator))

    (use-package evil-surround
      :after evil
      :config
      (global-evil-surround-mode 1))
  #+end_src

* wgrep mode
  #+begin_src emacs-lisp
    (use-package wgrep
      :after evil
      :commands
      (wgrep-finish-edit
       wgrep-finish-edit
       wgrep-abort-changes
       wgrep-abort-changes)
      :init
      (evil-define-key 'normal wgrep-mode-map (kbd "<escape>") 'wgrep-exit)
      (evil-define-key 'normal wgrep-mode-map (kbd ", ,") 'wgrep-finish-edit)
      (evil-define-key 'normal wgrep-mode-map (kbd ", k") 'wgrep-abort-changes))
  #+end_src

* code folding

  #+begin_src emacs-lisp
    (use-package hideshow
      :commands
      (hs-toggle-hiding
       hs-hide-block
       hs-hide-level
       hs-show-all
       hs-hide-all))
  #+end_src


  create arbitrary fold not like other package auto detect the program language

  #+begin_src emacs-lisp :tangle no
    (use-package vimish-fold
      :after evil
      :hook (prog-mode . vimish-fold-mode))

    (use-package evil-vimish-fold
      :after vimish-fold
      :hook (prog-mode . evil-vimish-fold-mode))
  #+end_src

* multiple-cursors
  it will save the command behavior applied on the multiple cursor to a file named .mc-lists.el.
  By default, it's path is =~/.emacs.d/.mc-lists.el= and I customize the storing path already.
  Research how evil-mc customize the multiple-cursor

  #+begin_src emacs-lisp
    (use-package multiple-cursors
      :init
      (global-set-key (kbd "C-S-a") 'mc/edit-lines)
      (global-set-key (kbd "C-S-<down-mouse-1>") 'mc/add-cursor-on-click)
      (global-set-key (kbd "<C-S-right>") 'mc/mark-next-like-this)
      (global-set-key (kbd "<C-S-left>") 'mc/mark-previous-like-this)
      :commands
      (mc/edit-lines
       mc/mark-all-like-this
       mc/add-cursor-on-click
       mc/mark-next-like-this
       mc/mark-previous-like-this))
  #+end_src

  #+begin_src emacs-lisp
    (use-package iedit
      :commands
      (iedit-restrict-region)
      :config
      (define-key iedit-occurrence-keymap-default
        (kbd "<escape>") #'(lambda () (interactive) (iedit-mode -1))))
  #+end_src

