modules/jemacs-unarrange_lp.org
* git version control

  ENHANCE: adjust the pop ui
  #+begin_src emacs-lisp
    (use-package git-messenger
      :defer t
      :init
      (setq git-messenger:show-detail t)
      (setq git-messenger:use-magit-popup t))

    (use-package magit
      :defer 2
      :custom
      ((magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
       (magit-repository-directories
        '(("~/Desktop/data_platform" . 1)
          ("~/Desktop/cdp-cache" . 1)
          ("~/Desktop/ansible-playground" . 1)
          ("~/Desktop/go-playground" . 1)
          ("~/Desktop/spacemacs-private" . 1)))))

    (use-package forge
      :defer 2
      :after magit)

  #+end_src

* auto-highlight-symbol

  Only the mode appears in the =ahs-plugin-bod-modes= can use beginning of the defun plugin

  #+begin_src emacs-lisp
    (use-package auto-highlight-symbol
      :commands
      (ahs-forward
       ahs-unhighlight
       ahs-unhighlight-all
       ahs-change-range
       ahs-change-range-internal
       ahs-dropdown-list-p
       ash-backward)
      :config
      (setq ahs-case-fold-search nil)
      (add-to-list 'ahs-plugin-bod-modes 'python-mode))
  #+end_src

