modules/jemacs-unarrange.el

(use-package auto-highlight-symbol
  :commands
  (ahs-forward
   ahs-unhighlight
   ahs-unhighlight-all
   ahs-change-range
   ahs-change-range-internal
   ahs-dropdown-list-p
   ash-backward)
  :config
  (setq ahs-case-fold-search nil)
  (add-to-list 'ahs-plugin-bod-modes 'python-mode))
