modules/jemacs-unarrange_lp.org
** hydra motion

   #+begin_src emacs-lisp
     (use-package hydra
       :defer t)

     (defhydra window-operate ()
       "
     Window management :)
     ^Resize^                ^select^                         ^Move^          ^Action^
     ^───────────────^       ^────────^                       ^────────^      ^────────^
     [_[_] : shrink h        [_h_]: left                      [_H_]: left       [_/_]: split vertically
     [_]_] : enlarge h       [_l_]: right                     [_L_]: right      [_-_]: split horizontally
     [_{_] : shrink v        [_k_]: up                        [_K_]: up         [_d_]: delete window
     [_}_] : enlarge v       [_j_]: down                      [_J_]: down
     [_=_] : balance         [_1_.._9_]: window 1..9
     [_m_] : window maximize
     "
       ("[" my-shrink-window-horizontally nil)
       ("]" my-enlarge-window-horizontally nil)
       ("{" my-shrink-window nil)
       ("}" my-enlarge-window nil)
       ("=" balance-windows nil)
       ("d" delete-window nil)
       ("m" toggle-maximize-buffer nil)
       ("h" evil-window-left nil)
       ("l" evil-window-right nil)
       ("k" evil-window-up nil)
       ("j" evil-window-down nil)
       ("r" rotate-windows-forward nil)
       ("L" evil-window-move-far-right nil)
       ("H" evil-window-move-far-left nil)
       ("J" evil-window-move-very-bottom nil)
       ("K" evil-window-move-very-top nil)
       ("/" evil-window-vsplit nil)
       ("-" evil-window-split nil)

       ("1" winum-select-window-1 nil)
       ("2" winum-select-window-2 nil)
       ("3" winum-select-window-3 nil)
       ("4" winum-select-window-4 nil)
       ("5" winum-select-window-5 nil)
       ("6" winum-select-window-6 nil)
       ("7" winum-select-window-7 nil)
       ("8" winum-select-window-8 nil)
       ("9" winum-select-window-9 nil))

     (defhydra hydra-org-roam ()
       "Launcher for `org-roam'."
       ("c" org-id-get-create "create node")
       ("i" org-roam-node-insert "insert")
       ("f" org-roam-node-find "find file")
       ("d" org-roam-dailies-goto-today "dailies")
       ("l" org-roam-buffer-toggle "back link buffer")
       ("g" my-org-roam-ui-open "graph")
       ("r" my-refresh-org-roam-db-cache "db refresh")
       ("t" org-roam-tag-add "add tag"))


     (defhydra buffer-operate ()
       "
     buffer management :)
     ^Move^                         ^action^
     ^────────^                     ^───────^
     [_n_] : next buffer            [_d_] : delete
     [_p_] : prev buffer
     [_b_] : project buffers
     [_B_] : buffers list
     [_o_] : other window
     "

       ("n" next-buffer nil)
       ("p" previous-buffer nil)
       ("b" counsel-projectile-switch-to-buffer nil)
       ("B" counsel-switch-buffer nil)
       ("o" other-window nil)
       ("d" kill-this-buffer nil))

     (defhydra hydra-text-scale (:timeout 8)
       "scale text"
       ("j" text-scale-increase "+")
       ("k" text-scale-decrease "-")
       ("0" ((lambda (inc) (text-scale-adjust inc)) 0) "reset")
       ("<escape>" nil "finished" :exit t))

     (defhydra hydra-mode-toggle ()
       "toggle mode"
       ("r" rainbow-mode "rainbow mode")
       ("w" whitespace-mode "whitespace-mode")
       ("t" counsel-load-theme "theme")
       ("v" visual-line-mode "visual line mode")
       ("f" flyspell-mode "check spell"))

     (defhydra hydra-table-mode ()
       "table-mode edit shortcut"
       ("+" table-insert-row-column "insert new row/column")
       ("*" table-span-cell "merge cell")
       (":" table-justify "align cell")
       ("-" table-split-cell-vertically "cell split horizontally")
       ("/" table-split-cell-horizontally "cell split vertically")
       ("<" table-narrow-cell "narrow cell")
       (">" table-widen-cell "widen cell")
       ("{" table-shorten-cell "shorten cell")
       ("}" table-heighten-cell "heighten cell"))
   #+end_src

   Originally, evil defines key =*= in motion-state with =evil-search-forward=

   #+begin_src emacs-lisp
     (setq ahs-default-range 'ahs-range-whole-buffer)

     (defun my-ahs-highlight-p ()
       "Ruturn Non-nil if symbols can be highlighted."
       (interactive)
       (let* ((beg (if (region-active-p) (region-beginning) (overlay-start ahs-current-overlay)))
              (end (if (region-active-p) (region-end) (overlay-end ahs-current-overlay)))
              (face (get-text-property beg 'face))
              (symbol (buffer-substring beg end)))

         (ahs-unhighlight t)
         (when (and symbol
                    (not (ahs-dropdown-list-p))
                    ;; (not (ahs-face-p (ahs-add-overlay-face beg face) 'ahs-inhibit-face-list))
                    ;; disable skip highlight for some font-face
                    (not (ahs-symbol-p ahs-exclude symbol t))
                    (ahs-symbol-p ahs-include symbol))
           (list symbol beg end))))

     (defun my-ahs-search-symbol (symbol search-range)
       "Search `SYMBOL' in `SEARCH-RANGE'."
       (save-excursion
         (let ((case-fold-search ahs-case-fold-search)
               ;; (regexp (concat "\\_<\\(" (regexp-quote symbol) "\\)\\_>" ))
               (regexp (regexp-quote symbol))
               (beg (car search-range))
               (end (cdr search-range)))
           (goto-char end)
           (while (re-search-backward regexp beg t)
             (let* ((symbol-beg (match-beginning 0))
                    (symbol-end (match-end 0))
                    (tprop (text-properties-at symbol-beg))
                    (face (cadr (memq 'face tprop)))
                    (fontified (cadr (memq 'fontified tprop))))
               (unless (or face fontified)
                 (setq ahs-need-fontify t))
               (push (list symbol-beg
                           symbol-end
                           face fontified) ahs-search-work))))))


     (defun my-ahs-light-up (current)
       "Light up symbols."
       (cl-loop for symbol in ahs-search-work

                for beg = (nth 0 symbol)
                for end = (nth 1 symbol)
                for face = (or (nth 2 symbol)
                               (get-text-property beg 'face))
                for face = (ahs-add-overlay-face beg face)

                do (let ((overlay (make-overlay beg end nil nil t)))
                     (overlay-put overlay 'ahs-symbol t)
                     (overlay-put overlay 'window (selected-window))
                     (overlay-put overlay 'face
                                  (if (ahs-face-p face 'ahs-definition-face-list)
                                      (if current ahs-definition-face
                                        ahs-definition-face-unfocused)
                                    (if current ahs-face ahs-face-unfocused)))
                     (push overlay ahs-overlay-list))))

     (advice-add 'ahs-light-up :override #'my-ahs-light-up)
     (advice-add 'ahs-highlight-p :override #'my-ahs-highlight-p)
     (advice-add 'ahs-search-symbol :override #'my-ahs-search-symbol)

     (defun expand-and-highlight-region ()
       (interactive)
       (er--expand-region-1)
       (highlight-region))

     (defun contract-and-highlight-region ()
       (interactive)
       (call-interactively 'er/contract-region)
       (highlight-region))


     (defun highlight-region ()
       (interactive)
       (let ((hh (my-ahs-highlight-p)))
         (unless ahs-current-range
           (ahs-change-range-internal ahs-default-range))
         (when hh
           (ahs-highlight (nth 0 hh)
                          (nth 1 hh)
                          (nth 2 hh)))))


     (defun evil-surround-region-utils (operation)
       ;; TODO: implement this one
       (interactive (evil-surround-interactive-setup))
       ;; (cond
       ;;  ((eq operation 'change)
       ;;   (call-interactively 'evil-surround-change))
       ;;  ((eq operation 'delete)
       ;;   (call-interactively 'evil-surround-delete))
       ;;  (t
       ;;   (evil-surround-setup-surround-line-operators)
       ;;   (evil-surround-call-with-repeat 'evil-surround-region))))

       (if (region-active-p)
           (evil-surround-setup-surround-line-operators)
         (evil-surround-call-with-repeat 'evil-surround-region)))


     (defhydra mark-operation ()
       "\nSwift knife %s(propertize (format \" %s \" (ahs-current-plugin-prop 'name)) 'face  (ahs-current-plugin-prop 'face))

     ^match^                   ^Search^                       ^edit^                        ^operation^
     ^^^─────────────────────────────────────────────────────────────────────────────────────────────────────────
     [_v_]: expand             [_s_]: swiper                  [_e_]: iedit                  [_t_]: send to vterm
     [_-_]: contract           [_/_]: counsel-projectile-rg   [_h_]: highlight
     [_r_]: range              ^ ^                            [_c_]: change surround
     [_n_]: next
     [_N_]: prev
     [_<escape>_]: quit
     "

       ("<escape>" (lambda ()(interactive) (ahs-unhighlight-all t)) nil :exit t)
       ("v" expand-and-highlight-region nil)
       ("-" contract-and-highlight-region nil)
       ;; counsel-projectile-rg-initial-input
       ("s" swiper-thing-at-point nil)
       ("c" evil-surround-region nil)
       ("/" my-counsel-projectile-rg nil)
       ("e" my-iedit-mode nil :exit t)
       ("h" highlight-region nil)
       ("r" my-change-range nil)
       ("t" send-text-and-move-to-projectile-vterm nil :exit t)
       ("n" my-ahs-forward nil)
       ("N" my-ahs-backward nil))

     (defun my-iedit-mode ()
       (interactive)
       (ahs-unhighlight-all)
       (call-interactively 'iedit-mode)
       (iedit-restrict-region
        (ahs-current-plugin-prop 'start)
        (ahs-current-plugin-prop 'end)))

     (defun my-change-range ()
       (interactive)
       (setq range (ahs-runnable-plugins t))
       (ahs-change-range-internal range)
       (if ahs-current-overlay
           (highlight-region))
       (iedit-restrict-region
        (ahs-current-plugin-prop 'start)
        (ahs-current-plugin-prop 'end)))

     (defun my-ahs-forward ()
       (interactive)
       (when (region-active-p)
         (deactivate-mark))
       (ahs-forward))

     (defun my-ahs-backward ()
       (interactive)
       (when (region-active-p)
         (deactivate-mark))
       (ahs-backward))

     (with-eval-after-load 'auto-highlight-symbol
       (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-change-range)
       (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-ahs-backward)
       (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-counsel-projectile-rg)
       (add-to-list 'ahs-unhighlight-allowed-commands 'mark-operation/my-ahs-forward))

     (defun wrap-mark-operation ()
       (interactive)
       (unless (region-active-p)
         (er--expand-region-1))
       (highlight-region)
       (mark-operation/body))

     (with-eval-after-load 'evil
       (evil-define-key '(normal motion) 'evil-motion-state-map
         (kbd "*") 'wrap-mark-operation))
   #+end_src

