modules/jemacs-unarrange_lp.org
* company
  company-mode setup

  #+begin_notes
  "<return>" is the Return key while emacs runs in a graphical user interface.
  "RET" is the Return key while emacs runs in a terminal. ...
  But the problem is, by binding (kbd "RET") , you are also binding (kbd "C-m")
  #+end_notes

  #+begin_src emacs-lisp
    (use-package company
      :defer 0
      :config
      (setq company-minimum-prefix-length 2)
      (setq company-idle-delay 0.1)
      (setq company-format-margin-function 'company-vscode-dark-icons-margin)
      ;; In evil-collection, it adjust the key binding for the company-mode
      ;; NOTE: Furthermore, it also disable the pre-select behavior when
      ;; showing the completion candidates.
      (define-key company-active-map (kbd "<return>") 'company-complete-selection)
      (global-company-mode 1))
  #+end_src

  NOTE: temporarily disable =company-tabnine= because it consumes lots of cpu.

  #+begin_src emacs-lisp :tangle no
    (use-package company-tabnine
      :config
      (with-eval-after-load 'company
        (add-to-list 'company-backends #'company-tabnine)
        (setq company-tabnine-always-trigger nil)
        (setq company-show-numbers t)
        (setq company-idle-delay 0.1)))
  #+end_src

* org

  https://orgmode.org/worg/org-contrib/org-drill.html

  we can check the org's version by the command =org-version=

  #+begin_src emacs-lisp
    (use-package org-ql
      :defer t)

    (use-package org-drill
      :defer t)

    (use-package org
      :defer t
      :init
      ;; cool! some functions need to be enable
      ;; like <s press tab to complete org structure (org-tempo)
      ;; these variables can be found in the source code of org.el
      (setq org-modules '(ol-w3m
                          ol-bbdb
                          ol-bibtex
                          ol-docview
                          ol-gnus
                          ol-info
                          ol-irc
                          ol-mhe
                          ol-rmail
                          ol-eww
                          org-habit
                          ol-git-link
                          org-protocol
                          org-tempo))


      (setq-default safe-local-variable-values
                    '((org-reveal-ignore-speaker-notes . (lambda (x) t))
                      (org-confirm-babel-evaluate . (lambda (x) t))
                      (eval . (progn
                                (when
                                    (and (not (equal buffer-file-name nil))
                                         (equal
                                          (string-match
                                           (regexp-quote org-roam-directory)
                                           (regexp-quote buffer-file-name))
                                          nil))
                                  (setq org-roam-directory (locate-dominating-file default-directory ".dir-locals.el"))
                                  (setq org-roam-db-location (concat org-roam-directory "org-roam.db")))))
                      (org-export-babel-evaluate . (lambda (x) t))))
      :config
      (keymap-unset org-mode-map "C-'" t)
      (setq org-export-backends '(ascii html icalendar latex odt md))

      ;; this will make org-shift to auto add timestamp after making a toto item complete
      (setq org-log-done 'time)
      (setq org-startup-truncated nil)
      (setq org-image-actual-width nil)
      (setq org-src-window-setup 'current-window) ;; org-edit-src without prompting window
      (setq org-agenda-use-tag-inheritance nil)

      (setq org-startup-folded t)
      ;; (setq org-ellipsis " ▾")
      (setq org-startup-with-inline-images t)
      (setq-default org-default-notes-file
                    "~/Dropbox/myorgs/todo.org")


      :ensure org-contrib)

    (use-package org-tree-slide
      :defer t
      :custom
      (org-image-actual-iwth nil))

    (use-package org-download
      :commands
      (org-download-screenshot
       org-download-clipboard)
      :defer t)

    (use-package org-journal
      :defer t)

    (use-package ox-reveal
      :after org)

    (use-package org-superstar
      :hook (org-mode . org-superstar-mode))

    (defun presentation-setup ()
      ;; Scale the text.  The next line is for basic scaling:
      (with-eval-after-load 'face-remap
        (setq text-scale-mode-amount 3)
        (text-scale-mode 1)))

    (defun presentation-end ()
      ;; Show the mode line again
      (setq text-scale-mode-amount 0)
      (text-scale-mode 0))


    (use-package org-tree-slide
      :defer t
      :hook ((org-tree-slide-play . presentation-setup)
             (org-tree-slide-stop . presentation-end))
      :custom
      (org-tree-slide-slide-in-effect t)
      (org-tree-slide-header t)
      (org-tree-slide-breadcrumbs " > ")
      (org-image-actual-iwth nil))

    (use-package visual-fill-column
      :init
      (setq visual-fill-column-width 150)
      (setq visual-fill-column-center-text t)
      :hook (org-mode . org-mode-visual-fill))

  #+end_src

** htmlize

   it's required when you want the html exported by =org-export= with syntax highlight effect.

   #+begin_src emacs-lisp
     (use-package htmlize
       :defer t)
   #+end_src

** org-roam

   This requires =sqlite3=. Ensure it's installed.

   Remember to run =org-roam-db-build-cache= at first time.

   #+begin_src emacs-lisp
     (use-package org-roam
       :straight
       (:host github :repo "org-roam/org-roam" :files (:defaults "extensions/*"))
       :after org
       :custom
       (org-roam-directory "/Users/jing/Dropbox/myorgs/life_books_courses_programming")
       (org-roam-db-location (concat org-roam-directory "org-roam.db"))
       :init
       (setq org-roam-v2-ack t)
       :config
       (setq org-roam-node-display-template (concat
                                             "${title:100}" (propertize "${tags:30}" 'face 'org-tag)))
       (setq org-roam-dailies-capture-templates
             `(("d" "default" entry
                "* %<%H:%M> %?"
                :target (file+head "%<%Y-%m-%d>.org"
                                   "#+title: %<%Y-%m-%d>\n#+filetags: :daily:"))))
       (setq org-roam-capture-templates
             `(("d" "default" plain "%?" :target
                (file+head "${slug}.org" "#+title: ${title}\n")
                :unnarrowed t)))
       (setq org-roam-dailies-directory "journal/")
       (org-roam-db-autosync-enable))


     (use-package org-roam-ui
       :straight
         (:host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
         :after org-roam
         :config
         (setq org-roam-ui-sync-theme t
               org-roam-ui-follow t
               org-roam-ui-update-on-save t
               org-roam-ui-open-on-start nil))

     (with-eval-after-load 'counsel
       (defun org-roam-todo ()
         "An ad-hoc agenda for `org-roam'."
         (interactive)
         (let* ((regex "^\\* TODO")
                (b (get-buffer (concat "*ivy-occur counsel-rg \"" regex "\"*"))))
           (if b
               (progn
                 (switch-to-buffer b)
                 (ivy-occur-revert-buffer))
             (setq unread-command-events (listify-key-sequence (kbd "C-c C-o M->")))
             (counsel-rg regex org-roam-directory "--sort modified")))))


     (defun ora-org-roam-find-file-action (x)
       (if (consp x)
           (let ((file-path (plist-get (cdr x) :path)))
             (org-roam--find-file file-path))
         (let* ((title-with-tags x)
                (org-roam-capture--info
                 `((title . ,title-with-tags)
                   (slug . ,(funcall org-roam-title-to-slug-function title-with-tags))))
                (org-roam-capture--context 'title))
           (setq org-roam-capture-additional-template-props (list :finalize 'find-file))
           (org-roam-capture--capture))))

     (defun ora-org-roam-find-file ()
       (interactive)
       (unless org-roam-mode (org-roam-mode))
       (ivy-read "File: " (org-roam--get-title-path-completions)
                 :action #'ora-org-roam-find-file-action
                 :caller 'ora-org-roam-find-file))
   #+end_src

** ob-async
   #+begin_src emacs-lisp
     (use-package ob-async
       :defer t)
   #+end_src
** toc-org
   #+begin_src emacs-lisp
     (use-package toc-org
       :defer t
       :init
       (add-hook 'org-mode-hook 'toc-org-mode)
       (add-hook 'markdown-mode-hook 'toc-org-mode)
       :commands (toc-org-insert-toc))
   #+end_src

** evil-org

   By default, you need to press M-RET to add a auto-numbering list
   this will has some agenda mode binding..

   If you want the key binding for org-agenda-mode, add the following settings.

   #+begin_src emacs-lisp :tangle no
     (require 'evil-org-agenda)
     (evil-org-agenda-set-keys)
   #+end_src


   #+begin_src emacs-lisp
     (use-package evil-org
       :after org
       :config
       (add-hook 'org-mode-hook 'evil-org-mode)
       (add-hook 'evil-org-mode-hook
                 (lambda ()
                   (evil-org-set-key-theme))))
   #+end_src

** restclient
   #+begin_src emacs-lisp
     (use-package restclient
       :defer t)

     (use-package ob-restclient
       :defer t
       :after (org restclient)
       :init (add-to-list 'org-babel-load-languages '(restclient . t)))
   #+end_src

** org table configuration

   #+begin_src emacs-lisp
     (with-eval-after-load 'org
       (defcustom org-html-tableel-org "no"
         "Export table.el cells as org code if set to \"t\" or \"yes\".
     This is the default and can be changed per section with export option:
     ,#+OPTIONS: HTML_TABLEEL_ORG: t"
         :type '(choice (const "no") (const "yes"))
         :group 'org-html)

       (eval-after-load 'ox-html
         '(eval ;;< Avoid eager macro expansion before ox-html is loaded.
           '(cl-pushnew
             (list
              :html-tableel-org
              "HTML_TABLEEL_ORG" ;; keyword
              "HTML_TABLEEL_ORG" ;; option for #+OPTIONS: line
              org-html-tableel-org ;; default value for the property
              t ;; handling of multiple keywords for the same property. (Replace old value with new one.)
              )
             (org-export-backend-options (org-export-get-backend 'html)))))

       (defvar org-element-all-elements) ;; defined in "org-element"
       (defun table-generate-orghtml-cell-contents (dest-buffer language cell info)
         "Generate and insert source cell contents of a CELL into DEST-BUFFER.
     LANGUAGE must be 'orghtml."
         (cl-assert (eq language 'html) nil
                    "Table cells with org content only working with html export")
         (let* ((cell-contents (extract-rectangle (car cell) (cdr cell)))
                (string (with-temp-buffer
                          (table--insert-rectangle cell-contents)
                          (table--remove-cell-properties (point-min) (point-max))
                          (goto-char (point-min))
                          (buffer-substring (point-min) (point-max)))))
           (with-current-buffer dest-buffer
             (let ((beg (point)))
               (insert (org-export-string-as string 'html t info))
               (indent-rigidly beg (point) 6)))))

       (defun my-org-html-table--table.el-table (table _info)
         "Format table.el tables into HTML.
     INFO is a plist used as a communication channel."
         (when (eq (org-element-property :type table) 'table.el)
           (require 'table)
           (let ((outbuf (with-current-buffer
                             (get-buffer-create "*org-export-table*")
                           (erase-buffer) (current-buffer))))
             (with-temp-buffer
               (insert (org-element-property :value table))
               (goto-char 1)
               (re-search-forward "^[ \t]*|[^|]" nil t)
               (table-recognize-region (point-min) (point-max) 1)
               (table-generate-source 'html outbuf))
             (with-current-buffer outbuf
               (prog1 (org-trim (buffer-string))
                 (kill-buffer))))))

       (defun org-orghtml-table--table.el-table (fun table info)
         "Format table.el TABLE into HTML.
     This is an advice for `org-html-table--table.el-table' as FUN.
     INFO is a plist used as a communication channel."
         (if (assoc-string (plist-get info :html-tableel-org) '("t" "yes"))
             (cl-letf (((symbol-function 'table--generate-source-cell-contents)
                        (lambda (dest-buffer language cell)
                          (table-generate-orghtml-cell-contents dest-buffer language cell info))))
               (funcall fun table info))
           (funcall fun table info)))

       (advice-add 'org-html-table--table.el-table :override #'my-org-html-table--table.el-table)
       (advice-add #'my-org-html-table--table.el-table :around #'org-orghtml-table--table.el-table))
   #+end_src

