modules/jemacs-unarrange_lp.org
** org configuration

   example settings for org-agenda-files
   #+begin_example
   (setq org-agenda-files (file-expand-wildcards "~/Dropbox/myorgs/*.org"))
   (setq org-agenda-files (directory-files-recursively "~/Dropbox/myorgs/" "\\.org$"))
   #+end_example


   #+begin_src emacs-lisp
     (with-eval-after-load 'org
       (org-babel-do-load-languages
        'org-babel-load-languages
        '((emacs-lisp . t)
          (shell . t)
          (dot . t)
          (sql . t)
          (python . t)))

       (add-to-list 'org-structure-template-alist '("sel" . "src emacs-lisp"))
       (add-to-list 'org-structure-template-alist '("sb" . "src bash"))
       (add-to-list 'org-structure-template-alist '("sp" . "src python"))


       ;; to produce font-face for org quote block
       (setq org-fontify-quote-and-verse-blocks t)

       (setq org-hide-emphasis-markers t)
       ;; hide the empasis syntax ex. *hi* -> bold hi

       (setq org-adapt-indentation t) ;; use indent-line-function to
       ;; see the indentation function used by org-mode
       ;; check the doc of org-indent-line, know how indent works

       (set-face-attribute 'org-block nil :background "#202021")
       (set-face-attribute 'org-quote nil :background "#202021")


       ;; set org table's font
       ;; (set-face-font 'org-table " ")
       ;; I use the visual-column instead
       ;; (add-hook 'org-mode-hook 'toggle-word-wrap)

       ;; Set faces for heading levels
       (dolist (face '((org-document-title . 1.5)
                       (org-level-1 . 1.3)
                       (org-level-2 . 1.2)
                       (org-level-3 . 1.15)
                       (org-level-4 . 1.1)
                       (org-level-5 . 1.0)
                       (org-level-6 . 1.0)
                       (org-level-7 . 1.0)
                       (org-level-8 . 1.0)))
         (set-face-attribute (car face) nil :font "Source Code Pro" :weight 'regular :height (cdr face)))

       ;; NOTE:
       ;; (setq org-format-latex-options
       ;;        (list :foreground 'default
       ;;              :background 'default
       ;;              :scale 1.5
       ;;              :html-foreground "Black"
       ;;              :html-background "Transparent"
       ;;              :html-scale 1.0
       ;;              :matchers '("begin" "$1" "$" "$$" "\\(" "\\[")))


       (setq org-download-screenshot-method "screencapture -i %s")
       (setq-default org-download-image-dir "./img")
       (setq org-download-image-org-width 500)

       (setq org-journal-dir "~/Dropbox/myorgs/journal/")
       (setq org-journal-file-type 'weekly)
       (setq org-journal-file-format "%Y-%m-%W.org")

       (setq org-agenda-files (split-string (shell-command-to-string "find ~/Dropbox/myorgs -type f | grep '.*.org$' | grep -E -v 'presentation/|journal/'") "\n" t))

       ;; to config the org refile
       (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
       (setq org-refile-use-outline-path 'file)
       (setq org-outline-path-complete-in-steps nil)

       ;; to allow creating a new heading when performing the org refile
       (setq org-refile-allow-creating-parent-nodes 'confirm)


       ;; customize the bullet symbol
       (custom-set-variables '(org-bullets-bullet-list '("❐" "○" "﹅" "▶")))
       (setq org-superstar-headline-bullets-list '("❐" "○" "✎" "⚈"))
       (setq org-hide-leading-stars t)

       ;; to customize the org-capture template and clear the template before
       ;; we add the template in the list.
       (setq org-capture-templates nil)

       (setq org-todo-keywords
             '((sequence "TODO" "IN PROGRESS" "|" "DONE" "PRESERVE")))

       (setq org-todo-keyword-faces
             '(("TODO" . "#dc752f")
               ("IN PROGRESS" . "#33eecc")
               ("NO_NEWS" . "#cdb7b5")
               ("ABANDON" . "#f2241f")
               ("OFFERGET" . "#4f97d7")))


       ;; in order to group the templates we need to add the key-description
       ;; pair first or it will not work
       (add-to-list 'org-capture-templates '("i" "Inbox"))
       (add-to-list 'org-capture-templates
                    '("im" "Misc Inbox" entry
                      (file+headline "~/Dropbox/myorgs/inbox.org" "Misc")
                      "** %^{title} %?\n %(current-kill 0)\n\n"))

       (add-to-list 'org-capture-templates '("b" "Bookmarks"))
       (add-to-list 'org-capture-templates
                    '("bb" "Blogs bookmarks" entry
                      (file+headline "~/Dropbox/myorgs/bookmarks.org" "Blogs")
                      "** %^{title} %?\n %(current-kill 0)\n\n"))
       (add-to-list 'org-capture-templates
                    '("bs" "Speeches bookmarks" checkitem
                      (file+headline "~/Dropbox/myorgs/bookmarks.org" "Speeches")
                      "- [ ] [[%(current-kill 0)][%^{link description}]]\n"))

       (add-to-list 'org-capture-templates '("t" "Todos"))
       (add-to-list 'org-capture-templates
                    '("td" "a one day todo" entry
                      (file+headline "~/Dropbox/myorgs/todo.org" "一天內可以解決的事項")
                      "** TODO %^{title} %?\n SCHEDULED: %^t\n%? "))
       (add-to-list 'org-capture-templates
                    '("tw" "a week todo" entry
                      (file+headline "~/Dropbox/myorgs/todo.org" "一週內可以解決的事項")
                      "** TODO %^{title} %?\n SCHEDULED: %t\n"))
       (add-to-list 'org-capture-templates
                    '("tl" "a longterm todo" entry
                      (file+headline "~/Dropbox/myorgs/todo.org" "長期計畫")
                      "** TODO %^{title} %?\n SCHEDULED: %t\n")))
   #+end_src

* provide package

  #+begin_src emacs-lisp
    (provide jemacs-unarrange)
    ;;; jemacs-unarrange.el ends here
  #+end_src
